<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Copyright 2024 Mario Panighetti.

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at

http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.</string>
	<key>Description</key>
	<string>Downloads the latest version of Aerial Companion from the vendor, creates an installer package, uploads it to Jamf Pro, then adds it to a Self Service policy.</string>
	<key>Identifier</key>
	<string>com.github.mpanighetti.jamf-upload.Aerial Companion</string>
	<key>Input</key>
	<dict>
		<key>PACKAGE_CATEGORY</key>
		<string>Utility</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Aerial Companion is the official companion app for the Aerial screen saver for macOS. It takes care of screen saver installation, updates, and more.</string>
		<key>SELF_SERVICE_POLICY_NAME</key>
		<string>%NAME%</string>
		<key>SELF_SERVICE_POLICY_TEMPLATE</key>
		<string>JamfUploader-PolicyTemplate-SelfService.xml</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.2</string>
	<key>ParentRecipe</key>
	<string>com.github.mpanighetti.pkg.Aerial Companion</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%PACKAGE_CATEGORY%</string>
			</dict>
			<key>Comment</key>
			<string>JamfCategoryUploader processor creates the category used for the installer package and Self Service policy in Jamf Pro.</string>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%PACKAGE_CATEGORY%</string>
			</dict>
			<key>Comment</key>
			<string>JamfPackageUploader processor uploads the installer package to Jamf Pro.</string>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%UPDATE_PREDICATE%</string>
			</dict>
			<key>Comment</key>
			<string>StopProcessingIf processor ends the recipe early if the downloaded application version already exists in Jamf Pro.</string>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
	</array>
</dict>
</plist>
